Revit 2024 API
RebarSystemSpanSymbol Class
 Represents a Rebar System Span Symbol element in Autodesk Revit.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class RebarSystemSpanSymbol : IndependentTag
Visual Basic
Public Class RebarSystemSpanSymbol _
	Inherits IndependentTag
Visual C++
public ref class RebarSystemSpanSymbol : public IndependentTag
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Element
 Autodesk.Revit.DB.IndependentTag
 Autodesk.Revit.DB.Structure.RebarSystemSpanSymbol
See Also
RebarSystemSpanSymbol Members
Autodesk.Revit.DB.Structure Namespace